{
	"title": {
		"media": {
			"url": "https://s40424.pcdn.co/in/wp-content/uploads/2023/03/types-of-machine-learning.jpg.optimal.jpg",
			"caption": "A Historical Timeline of Machine Learning Breakthroughs",
			"credit": "IBM"
		},
		"text": {
			"headline": "Machine Learning Unfolded: A Timeline of Pioneering Achievements",
			"text": "<p>Machine learning (ML) is a branch of artificial intelligence that empowers computers to mimic human learning, enabling them to perform tasks autonomously and enhance accuracy by learning from more data. At its core, a machine learning system involves a decision-making component, an error function for evaluating predictions, and an iterative optimization process that adjusts the model to improve performance.</p>"
		}
	},
	"events": [
		{
			"media": {
				"url": "https://historyofinformation.com/images/Screen_Shot_2020-09-09_at_6.46.46_AM_big.png",
				"caption": "Computational groundwork for neural networks",
				"credit": "History of Information</a>"
			},
			"start_date": {
				"year": "1943"
			},
			"text": {
				"headline": "The First Mathematical Model of Neurons Emerges",
				"text": "<p>In 1943, Warren McCulloch and Walter Pitts published “A Logical Calculus of the Ideas Imminent in Nervous Activity,” introducing the first mathematical model of a neural network. Drawing from Alan Turing's theoretical work, they showed how simple interconnected elements could represent complex computation marking a foundational moment in the evolution of artificial intelligence.</p><p>Their ideas would later influence pioneers like John von Neumann and Norbert Wiener, embedding neural networks into the broader narrative of computing and AI.</p>"
			}
		},
		{
			"media": {
				"url": "https://www.youtube.com/watch?v=VMPJp7CDuyI&pp=ygUTd2hhdCBpcyBUdXJpbmcgVGVzdA%3D%3D",
				"caption": "The first AI benchmark",
				"credit": "<a href=\"https://www.youtube.com/watch?v=VMPJp7CDuyI&pp=ygUTd2hhdCBpcyBUdXJpbmcgVGVzdA%3D%3D\">Tech Index</a>"
			},
			"start_date": {
				"year": "1950"
			},
			"text": {
				"headline": "The Turing Test (Imitation Game)",
				"text": "Alan Turing, an English mathematician, cryptanalyst, and computer scientist, introduced the Turing Test in his 1950 paper “Computing Machinery and Intelligence” as a method to evaluate whether a machine could convincingly imitate human responses. In the test, a human judge interacts separately with both a human and a machine, and if the judge cannot reliably tell them apart more than half the time, the machine is considered to have passed."
			}
		},
		{
			"media": {
				"url": "https://assets.ibm.com/is/image/ibm/5331_as_portrait?dpr=on%2C1&wid=1536&hei=2435",
				"caption": "A Self-learning system",
				"credit": "IBM"
			},
			"start_date": {
				"year": "1952"
			},
			"text": {
				"headline": "Samuel Checkers-Playing Program and the Birth of Machine Learning",
				"text": "Arthur Samuel of IBM created one of the first self-learning programs in the 1950s, a checkers player for the IBM 701.  He creatively employed alpha-beta pruning and a scoring system to assess board positions without thoroughly playing every move out because he had limited memory.  Samuel's program was important because it tracked positions and their win/loss results, which helped it make better selections over time.  He gave this procedure the name machine learning, which has since become a key concept in artificial intelligence.  Samuel's checkers software defeated a human checkers master in 1962 after completing thousands of self-games, demonstrating early but significant lessons in adaptive computation."
			}
		},
		{
			"media": {
				"url": "https://www.youtube.com/watch?v=UeKxO-Sk0wE&pp=ygUrd2hhdCBpcyBwZXJjZXB0cm9uIGJ5IGZyYW5rIHJvc2VuYmxhdHQgdGVzdA%3D%3D",
				"caption": "The Perceptron: An early neural model that learns to classify.",
				"credit": "<a href=\"https://www.youtube.com/watch?v=UeKxO-Sk0wE&pp=ygUrd2hhdCBpcyBwZXJjZXB0cm9uIGJ5IGZyYW5rIHJvc2VuYmxhdHQgdGVzdA%3D%3D\">New Machina</a>"
			},
			"start_date": {
				"year": "1957"
			},
			"text": {
				"headline": "Rosenblatt’s Perceptron",
				"text": "Frank Rosenblatt's perceptron is a pioneering neural model for binary classification that assigns weights to input values and sums them before deciding on an output using threshold activation. Designed as a simple, trainable neuron, it adjusts its weights based on data to improve accuracy, but it can only solve linearly separable problems, paving the way for more complicated neural networks."
			}
		},
		{
			"media": {
				"url": "https://www.youtube.com/watch?v=b6uHw7QW_n4&pp=ygUaTmVhcmVzdCBOZWlnaGJvciBBbGdvcml0aG0%3D",
				"caption": "Understanding the Nearest Neighbor algorithm in action",
				"credit": "<a href=\"https://www.youtube.com/watch?v=b6uHw7QW_n4&pp=ygUaTmVhcmVzdCBOZWlnaGJvciBBbGdvcml0aG0%3D\">IBM Technology</a>"
			},
			"start_date": {
				"year": "1967"
			},
			"text": {
				"headline": "K-Nearest Neighbor Algorithm",
				"text": "The nearest neighbor algorithm classifies a data point by measuring its similarity to the closest labeled examples in the dataset. As one of the earliest pattern recognition methods, it laid the groundwork for modern supervised learning."
			}
		},
		{
			"media": {
				"url": "https://www.youtube.com/watch?v=gW7h9B_byv4&pp=ygUfMTk4MCDigJMgUmlzZSBvZiBFeHBlcnQgU3lzdGVtcw%3D%3D",
				"caption": "Expert Systems Make Their Mark ",
				"credit": "MindSparkAI."
			},
			"start_date": {
				"year": "1980"
			},
			"text": {
				"headline": "Expert systems of the 1970s–1980s: from DENDRAL to XCON",
				"text": "Rule-based expert systems made the transition from research labs to industry in the early 1980s.  These systems, which were based on an inference engine and a knowledge repository, used if-then rules to address specific problems by capturing domain expertise.  Earlier experiments like DENDRAL and MYCIN showed the approach's potential in chemistry and medicine, while systems like XCON configured DEC's VAX computers.  Before interest decreased in the 1990s, expert systems were one of AI's first commercial successes due to their widespread use throughout the decade.'"
			}
		},
		{
			"media": {
				"url": "https://assets.ibm.com/is/image/ibm/1997_deep-blue_rematch_322:16x9?dpr=on%2C1&wid=1536&hei=864",
				"caption": "Deep Blue’s processor cabinets the hardware behind its historic chess match",
				"credit": "IBM"
			},
			"start_date": {
				"year": "1997"
			},
			"text": {
				"headline": "Deep Blue Becomes First Computer to Defeat a World Chess Champion",
				"text": "A new era in artificial intelligence and computers began in May 1997 when IBM's Deep Blue became the first computer system to defeat Garry Kasparov, the current world chess champion, under normal tournament time limits.</p><p>The massively parallel architecture of 32 processors that Deep Blue used to do this was able to evaluate almost 200 million chess positions each second, which translates to about 11.38 billion floating-point operations per second. Compared to prior devices like IBM's STRETCH (launched in 1961), which ran at less than 500 flops, this marked a significant increase in processing power."
			}
		},
		{
			"media": {
				"url": "https://miro.medium.com/v2/resize:fit:720/format:webp/1*AwgR2c5C2SGj6PNm95Cyvg.jpeg",
				"caption": "Deep learning breakthrough",
				"credit": "Concise Software"
			},
			"start_date": {
				"year": "2006"
			},
			"text": {
				"headline": "The Emergence of Deep Learning",
				"text": "The term 'deep learning' was coined by Geoffrey Hinton in 2006 to refer to a new class of techniques that allowed computers to identify and distinguish text or objects in texts and photographs.  Modern AI applications in computer vision, speech recognition, and natural language processing were made possible by this breakthrough, which represented a major leap in machine learning. "
			}
		},
		{
			"media": {
				"url": "https://www.hdatasystems.com/assets/uploads/banner/1639014633.jpg"
			},
			"start_date": {
				"year": "2025"
			},
			"text": {
				"headline": "References",
				"text": "<p>Concise Software. (2020, October 6). A brief history of machine learning. Concise Software. https://concisesoftware.com/blog/history-of-machine-learning/ </p> IBM. (n.d.). The games that helped AI evolve. IBM. https://www.ibm.com/history/early-games </p> Norman, J. M. (Ed.). (2025). McCulloch & Pitts publish the first mathematical model of a neural network. History of Information. https://www.historyofinformation.com/detail.php?entryid=782</p>"
			}
		}
	]
}
